# Built In Failures Reshape From Facets Failures Reshape From Facets Failed Property

Source: https://www.revitapidocs.com/2026/77f402a8-9826-e2a3-d87a-17d86cdc719b.htm

---

| Built In Failures Reshape From Facets Failures Reshape From Facets Failed Property |
| --- |

Reshape from facets failed. \[Description]
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId ReshapeFromFacetsFailed { get; }
```

```
Public Shared ReadOnly Property ReshapeFromFacetsFailed As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ ReshapeFromFacetsFailed {
	FailureDefinitionId^ get ();
}
```

```
static member ReshapeFromFacetsFailed : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ReshapeFromFacetsFailures Class Autodesk.Revit.DB Namespace